# coding: utf-8


import os
import json
from py2neo import Graph,Node

class MedicalGraphFromJson:
    def __init__(self):
        cur_dir = '/'.join(os.path.abspath(__file__).split('/')[:-1])
        self.data_path = os.path.join(cur_dir, 'newdata')
        # self.g = Graph(
        #     host="localhost",  # neo4j 搭载服务器的ip地址，ifconfig可获取到
        #     http_port=7687,  # neo4j 服务器监听的端口号
        #     user="neo4j",  # 数据库user name，如果没有更改过，应该是neo4j
        #     password="mathssuifeng6")
        self.g=Graph("bolt://localhost:7687", auth=("neo4j", "neo4j"))
        # self.rel_files=[]
        # self.init_rel_files()
        self.rel_file='relations.json'
        self.node_file='entities.json'

    # def init_rel_files(self):
    #     files=[
    #         'need_check.json',
    #         'has_symptom.json',
    #         'cure_way.json',
    #         'acompany_with.json',
    #         'recommand_drug.json',
    #         'drugs_of.json',
    #         'do_eat.json',
    #         'common_drug.json',
    #         'belongs_to_0.json',
    #         'belongs_to_1.json',
    #         'recommand_eat.json',
    #         'no_eat.json'
    #     ]
    #     self.rel_files=files

    def build_graph(self):
        res=self.build_nodes()
        if res==-1:
            print('no nodes file, can not create relations')
            return
        self.build_rels()

    def build_nodes(self):
        node_file=os.path.join(self.data_path,self.node_file)
        if not os.path.exists(node_file):
            return -1
        nodes=json.load(open(node_file))
        for node in nodes:
            self.create_node(node)
        return 0
    # "name": "成人呼吸窘迫综合征",
    #         "desc": "成人呼吸窘迫综合征简称ARDS，是一种继发的，以急性呼吸窘迫和低氧血症为特征的综合征。又称休克肺、创伤肺等。为成人急性呼吸衰竭的一种类型。病因包括：休克、严重感染、颅脑损伤、严重创伤、骨折时脂肪栓塞、输血输液过量、DIC、吸入刺激性气体、氧中毒、长期使用呼吸器、体外循环、昏迷或全身麻醉后误吸、烧伤等。尽管原发损害不同，但在肺脏所引起的病理生理改变却相似，其主要特点为：①肺微血管壁通透性增加，间质水肿；②肺表面活性物质缺失，肺泡群萎陷。",
    #         "prevent": "对高危的患者应严密观察，加强监护，当发现呼吸频速，PaO2降低等肺损伤表现，应早期给予呼吸支持和其它有效的预防及干预措施，防止ARDS进一步发展和重要脏器损伤。",
    #         "cause": "化脓性感染可使细菌毒素或细胞破溃产物进入肺循环。在内毒素作用下，体内释放出血管活性物质，能使毛细血管通透性增加。感染还可以转移至肺部，从而并发肺功能衰竭。\n休克、创伤者由于大量失血造成的低血容量，可致心输出量降低，同时也造成肺血流量减少。由于肺血容量的减少和源源不断地接受体循环而来的微型栓子，可堵塞肺血管床，致阻碍气体交换的进行。\n这是因为脑创伤可以激发强烈的交感神经冲动，导致显著的末梢血管收缩，随即迅速发生急性心力衰竭和肺水肿。\nARDS是由许多原因引起的急性肺泡-毛细血管膜损伤，有些原因可直接损伤肺：如①吸入烟雾，毒气，胃内容物及溺水；②服用过量海洛因或水杨酸盐；③细菌，病毒及真菌等所致肺部感染；④脂肪，羊水及血栓等引起肺栓塞；以及⑤肺挫伤，放射线损伤与氧中毒等。有些全身性病理过程可引起肺损伤，如败血症、休克、弥散性血管内凝血、过敏反应、创伤及烧伤等，烧伤面积超过40%就可能导致Pao2明显降低，有些治疗措施也可能引起ARDS，如血液透析，体外循环，用尼龙丝去除白细胞等。\n根据病因的不同及病变特点，ARDS曾有20多个名称，如创伤后湿肺，败血症肺，休克肺，输血后肺，微血管漏出综合征，充血性肺不张，透明膜病，出现性肺综合征，僵肺综合症，进行性肺实变等。\n成人呼吸窘迫综合征的病理变化\n各种原因所致急性肺泡-毛细血管膜损害的病理变化均类似，可分为急性阶段与慢性阶段病变：\n(一)急性阶段病变\n主要为广泛肺泡血管内皮和肺泡上皮损伤所致肺水肿，首先是肺间质水肿，后出现肺泡水肿，肺重可达正常值之三倍，肺泡腔内液体蛋白质含量高，甚而是血性液体，并有血细胞，巨噬细胞，细胞碎片，无定形物质，纤维蛋白条和表面活性物质的残存物，偶而可见细胞碎片和蛋白等物质在纤维蛋白网眼中形成透明膜。\n(二)慢性阶段病变\n发病数天后进入慢性阶段，病变以细胞增生为主，两周后即可出现纤维化，Ⅱ型上皮细胞增生取代了变性坏死的Ⅰ型肺泡上皮细胞，加上各种细胞的浸润使肺泡间隔增厚，肺泡腔与肺泡管内富含蛋白质的液体机化而形成纤维化。\n成人呼吸窘迫综合征的发病机制\nARDS的病变主要是肺泡-毛细血管膜损伤引起肺水肿和继后的细胞增生和纤维化，细胞增生反应和纤维化的机制和炎症修复过程相同，故此处着重讨论急性肺损伤的机制。\nARDS病人均有肺动脉高压，故有人强调肺微血管内高压为肺水肿的原因，但病人肺动脉楔压往往并不高，说明毛细血管压并不一定高，水肿液蛋白质含量丰富，动物实验也证明，类似ARDS的动物模型肺淋巴液流量增大，肺淋巴液中蛋白质浓度与血浆蛋白质浓度之比值大于0.7；此时，静脉注入的高分子右旋糖酐(分子量500，000)可透入肺泡液，均说明ARDS时的肺水肿主要是渗透性肺水肿，由于肺泡-毛细血管膜损伤使其通透性增高所致。\nARDS中肺泡毛细血管膜通透性增高的机制并未完全阐明，有些原始病因能直接损伤肺泡毛细血管膜使其通透性增高，如吸入胃酸，毒气，烟熏，放射性损伤及细胞毒素作用等。大量实验表明，更主要的是继发性损伤，即通过白细胞和血小板在肺内聚集引起肺泡-血管膜损伤使其通透性增高。\n(一)中性粒细胞在ARDS发病中的作用\nARDS病人外周血液中中性粒细胞数减少，肺活检可见肺内有中性粒细胞聚集和浸润，支气管肺泡洗出液中中性粒细胞可增加20～100倍，现在一般认为中性粒细胞在肺中聚集，激活，释放氧自由基，蛋白酶和脂质代谢产物，从而导致肺微血管膜及肺泡上皮的损伤，是ARDS肺水肿的主要发病机制。\n1、中性粒细胞在肺血管中聚集：正常人在直立体位时约有10～20%的中性粒细胞聚集在肺毛细血管床中，这是一种物理性扣留，由于一个肺泡有近千节(segment)毛细血管，每节毛细血管长1～30μm(平均8μm)，直径1～15μm(平均5μm)，一个血细胞从肺动脉流入肺静脉要经过100个以上的毛细血管节，中性粒细胞直径大于毛细血管口径，其形状与红细胞相比更接近球形，故变形能力较差，变形速度较慢，所以中性粒细胞易被扣留在肺毛细血管床中。由于肺毛细血管床容量较大，白细胞的扣留对肺血管的阻力和肺动脉压的影响不大，物理性扣留的中性粒细胞一般不进入肺泡腔，故正常人支气管肺泡洗出液中的细胞90～95%是巨噬细胞。\nARDS时中性粒细胞在肺血管中的聚集是化学性粘附(adhesion)，是由于趋化因子作用的结果，实验证明，中性粒细胞经趋化因子激活后与血管内皮细胞之间的亲和力显著增强，肺泡毛细血管总面积达60m2,可粘附大量中性粒细胞，以至使外周血液中白细胞数减少。\n趋化因子种类很多，主要有补体激活产物C5a，纤维蛋白降解产物(FDP)，花生四烯酸代谢产物如白三烯B4(LTB4)，羟花生四烯酸(HETE)和血栓素A2(AXA2)，血小板活化因子(PAF)，以及其他具趋化作用的蛋白质，多肽和脂质，其中研究较多的是补体的作用，在临床确诊ARDS前8小时血浆C5a往往已升高，激活的补体本身并不直接损伤肺血管内皮细胞，它是通过激活中性粒细胞起损伤作用，给出羊灌注激活的补体可导致肺水肿。如先用氮芥使粒细胞减少后再灌注激活之补体，则肺水肿的发生明显较经，激活的中性粒细胞可浸润入肺间质和进入肺泡腔，ARDS病人支气管肺泡洗出液中存在补体碎片及大量中性粒细胞，近年来发现中性粒细胞表面有一组糖蛋白，后者与粒细胞的粘附和吞噬功能有关，它们是巨噬细胞分子-1(macrophage-1,Mac-1)淋巴细胞功能相关抗原-1(lymphocyte function associated antegen-1，LFA-1)，其中Mac-1与粘附功能关系最密切，正常中性粒细胞表面仅有少量Mac-1表达，在病理情况下，趋化因子的作用使中性粒细胞表面Mac-1表达量增加，促进中性粒细胞与血管内皮细胞间的粘附。\n2、中性粒细胞对肺泡-毛细血管膜的损伤：动物实验中静脉注入内毒素，空气等可复制急性肺微血管损伤的模型，用佛波豆蔻醚乙酸盐(phorbol myristate acetate，PMA)激活的中性粒细胞灌注离体肺也可使肺毛细血管通透性增高，如先用羟基脲，氮芥等使动物中性粒细胞数减少，则内毒素，空气栓子等对肺微血管的损伤明显减轻，细胞培养中发现，中性粒细胞秘须紧密粘附于内皮细胞才能使单层肺动脉内皮的通透性增高，以上说明减轻，细胞培养中发现，中性粒细胞必须紧密粘附于内皮细胞才能使单层肺动脉内皮的通透性增高，以上说明，中性粒细胞的粘附与激活在ARDS发病中具有重要作用，很可能是中性粒细胞激活时释放的氧自由基，蛋白酶，脂质代谢产物和肽类物质等造成肺泡-毛细血管膜的损伤。\n(1)氧自由基的作用：中性粒细胞被激活时，耗氧量急剧上升，比静息时增加数倍至数十倍，此时细胞膜上的NADPH氧化酶(NADPh oxidase)被激活，将还原型辅酶Ⅱ(NADPH)转变为氧化型(NADP)，氧分子则获得电子形成超氧阴离子O2-，由O2-又可生成H2O2和OH，将正常中性粒细胞和其激活剂PMA一起灌注离体肺可引起肺水肿，水肿液蛋白质含量高；如将遗传性慢性肉芽肿病患者的中性粒细胞与PMA灌注则不引起肺水肿，因为慢性肉芽肿病患者的中性粒细胞缺乏NADPH氧化酶，氧自由基的生成少，另外，静脉内注射氧自由基清除剂，如超氧化物歧化酶(SOD)，过氧化氢酶，过氧化物酶，二甲本硫脲等，可减轻实验动物的急性肺损伤，可见，中性粒细胞激活时通过释放氧自由基引起肺损伤。\n氧自由基损伤肺微血管内皮及肺泡上皮细胞的作用可能有以下几个方面：①作用于细胞膜和细胞器膜，使其脂质过氧化，从而损害细胞膜和细胞膜的结构和功能；②作用于酶，使之失活；③作用于α1—蛋白酶抑制物，使之失活，从而增强溶酶体释放的蛋白酶对组织的破坏作用；④作用于血浆成份，可形成一种很强的趋化物，引起更多的中性粒细胞在肺内聚集与激活，产生更多的氧自由基，由此形成阳性反馈，加重肺的损伤。\n(2)蛋白酶的作用：中性粒细胞中溶酶体含有多种中性蛋白酶和酸性蛋白酶，当中性粒细胞被激活或破坏时，释出的这些酶可引起周围蛋白质的分解和组织结构的破坏，使肺泡-毛细血管膜的通透性增高，其中研究较多的是中性粒细胞弹性蛋白酶，例如实验中发现，ARDS病人支气管肺泡洗出液中弹性蛋白酶活性很高，给动物注射内毒素或油酸复制ARDS模型时，其血浆及肺泡洗出液中弹性蛋白酶含量也增多；给动物注射中性粒细胞弹性蛋白酶可引起肺血管内皮及肺泡上皮的通透性增高；组织培养中加入弹性蛋白酶导致内皮细胞分散等，说明中性粒细胞弹性蛋白酶与ARDS中的肺损伤有关，弹性蛋白酶可降解弹性蛋白，胶原蛋白，纤维连接蛋白(fibronectin,FN)等，纤维连接蛋白在内皮细胞之间和内皮细胞与基底膜之间起“锚连”作用，纤维连接蛋白受损，则血管通透性增高。\n肝脏和肺泡巨噬细胞能合成α1-蛋白酶抑制物(α1-protease inhibitor,α1-PI)，后者能抑制弹性蛋白酶，虽然ARDS病人血浆α1-PI可正常，支气管肺泡洗出液中α1-PI活性却降低，可能由于中性粒细胞产生的自由基使其氧化灭活所致，蛋白酶与蛋白酶抑制物间的失衡更加重了蛋白酶对组织的损伤，使肺泡-毛细血管膜通透性增高。\n3、脂类代谢产物的作用：内毒素等许多致病因素激活中性粒细胞，巨噬细胞，肥大细胞，内皮细胞等细胞膜上的磷脂酶A2，使膜磷脂裂解为花生四烯酸，后者通过环加氧酶途生成前列腺素，通过脂加氧酶途径生成白三烯，一般认为白三烯，TXA2，和PGF2α既可收缩肺小动脉引起肺动脉高压，也能增加肺微血管的通透性；而PGI2和PGE1则有扩张血管，降低血压，和使血管通透性降低的作用，急性肺损伤的动物及病人肺泡洗出液及血液中TXA2，PGF2α和LTs均增多，有实验证明PGI2和PGE1对急性肺损伤有一定的治疗作用，白细胞，巨噬细胞，肥大细胞和内皮细胞等激活后还可释放血小板活化因子(PAF)，PAF可促使血小板聚集和TXA2合成，从而导致微血管通透性增高。\n4、蛋白类物质的作用巨噬细胞等激活后尚可释放蛋白类物质,其中较重要的有肿瘤坏死因子(TNF)及白细胞介素ⅠIL-1)，人及动物在内毒素血症时血浆中TNF和IL-1增多，TNF能使肺血管通透性增高,并促使中性粒细胞在肺中聚集;IL-1剌激T淋巴细胞产生白细胞介素2(IL-2),后者也可使肺血管通透性增高。\n总之,现在一般认为,中性粒细胞巨噬细胞在肺内聚集，激活释出大量氧自由基和蛋白酶及脂类代谢产物和蛋白类,引起肺泡-毛细血管膜的损伤和通透性增高,导致肺水肿，这是ARDS的主要发病机制，虽然有报导白细胞减少的病人患败血症时也可发生急性肺损伤，用药物使动物中性粒细胞减少对注油酸引起肺损伤并无明显影响，但这些事实并不足以否定中性粒细胞的致病作用，因为外周血液中的中性粒细胞数不一定能反映肺循环中的粒细胞数，而且究竟需要多少中性粒细胞激活就足以引起急性肺损伤尚不了解，也可能正常聚集在肺血管中的中性粒细胞只有一部分被激活就足以损伤肺而导致ARDS。\n(二)凝血系统在ARDS发病中的作用\nARDS病人肺活检及死后尸解发现，肺小动脉血栓可发生于肺充血，水肿，出血及透明膜的形成之前，ARDS病人合并有弥散性血管内凝血者，其低氧血症和肺顺应性降工远较未合并DIC者为重，中性粒细胞激活和肺组织损伤所释放的促凝物质，肺血管内皮损伤和血液停滞，可导致血小板聚集和血管内凝血形成微血栓，肺内广泛微血栓形成可能引起：①肺循环阻力增加使肺动脉压升高，未堵塞的肺血管则血液量增大和毛细血管压升高，导致压力性肺水肿；②血栓损伤血管壁和血小板释放的血管活性物质以纤维蛋白降解产物，可使血管通透性增高致渗透性肺水肿；③血小板的消耗，纤维蛋白降解产物的抗凝作用，和血管壁的损伤可引起肺内出血；④血小板释放的5-HT等介质使支气管收缩，影响肺通气，近年特别引人注目的是纤维蛋白降解产物(FDP)的作用，发现严重创伤烧伤或感染病人中，已合并ARDS者血中FDP水平比未发生ARDS者高得多，而且ARDS病情与FDP浓度有一定平行关系，将纤维蛋白碎片D(FD)注入家兔血管，可引起进行性外周血液血小板减少，肺间质内白细胞浸润，肺血管通透性增高和肺功能不全;如注入血浆白蛋白，纤维蛋白及纤维蛋白碎片E，则不出现以上病变，很可能小板上有FD特异的膜受体，后者与FD结合可激活血小板，引起血小板聚集和释放反应，另外，FD也是趋化物，能促使中性粒细胞在肺内聚集，粘附和激活，由此加重肺的损害。\n正常肺毛细血管内皮的通透性比肺泡上皮高10倍，ARDS中肺毛细血管通透性的变化早于肺泡上皮，故先发生肺间质水肿，后出现肺泡水肿，肺泡上皮的损伤使Ⅱ型上皮细胞生成的表面活性物质减少，可导致肺不张，形成功能性分流。\n在全身性病理过程如败血症，休克等，中性粒细胞粘附于血管内皮以及血管内凝血引起的组织损伤，不仅发生于肺内，也可发生于肝，肾，肠，心，内分泌器官等处。故不能把ARDS看成仅仅是肺的损伤，但肺的血流量最大，毛细血管床面积也最大，故肺受累最重，使病人主要表现为急性呼吸衰竭。\n成人呼吸窘迫综合征时肺呼吸功能变化\nARDS所致外呼吸功能障碍以肺泡通气-血流比例失调为主，加上弥散功能障碍，表现为低氧血症性呼吸衰竭，极严重病例有总的肺泡通气量减少时可出现高碳酸血症性呼吸衰竭。\n(一)肺泡通气-血流比例失调\n由于Ⅱ型肺泡上皮细胞受损致表面活性物质的生成减少，肺泡水肿使表面活性物质被稀释和破坏，和肺泡过度通气引起的表面活性物质消耗，以致肺泡表面张力升高，肺顺应性降低，导致肺不张，由此形成功能性分流和真性分流，中性粒细胞等释出的白三烯等介质使支气管收缩，和水肿液堵塞小气道，气可造成肺通气障碍而形成功能性分流，ARDS病人分流量可达肺血流量的30%，肺血管内微血栓形成，血管活性物质引起不均匀的肺血管收缩，以及肺间质水肿对血管的压迫，不仅可增加肺血管阻力使肺动脉压升高，尚可增加死腔样通气，因此，肺泡通气-血流比例失调是病人发生呼吸衰竭最主要的原因。\n(二)弥散功能障碍\n肺间质和肺泡水肿，透明膜的形成和慢性阶段细胞的增生及肺纤维化，均可增加弥散膜的厚度，导致弥散功能障碍。\n(三)肺泡通气量减少\nARDS时肺部病变的分布是不均的，肺顺应性降低引起的限制性通气障碍和小气道阻塞引起的阻塞性通气障碍，造成部分肺泡通气量减少，未受累或病变较轻的肺泡反而代偿性通气增强，排出过多的二氧化碳，故病人Paco2反而降低，当肺泡-毛细血管膜损伤更广泛更严重时，全肺总的肺泡通气量将减少，CO2将潴留而发生高碳酸血症，此时Pao2将进一步下降。\n肺通气障碍，Pao2降低对血管化学感受器的剌激，肺充血和肺水肿对J感觉器的剌激，导致病人呼吸窘迫，感受器(juxtapulmonary capillary receptor)位于肺泡毛细血管旁，能感受毛细血管压力剌激，肺充血，肺水肿受剌激反射性地引起呼吸加快。",
    #         "easy_get": "无特定人群",
    #         "cure_department": "",
    #         "cure_way": "",
    #         "cure_lasttime": "2-4月",
    #         "symptom": "",
    #         "cured_prob": "85%",
    #         "get_prob": "3%"
    def create_node(self,node):
        label=node['label']
        node1=node['name']
        if label == 'Disease':
            n=Node(label,name=node1['name'],desc=node1['desc'],
                        prevent=node1['prevent'] ,cause=node1['cause'],
                        easy_get=node1['easy_get'],cure_lasttime=node1['cure_lasttime'],
                        cured_prob=node1['cured_prob'])   # 属性


        else:

            n = Node(label, name=node['name'])
        self.g.create(n)

    def build_rels(self):
        rel_file=os.path.join(self.data_path,self.rel_file)
        if not os.path.exists(rel_file):
            print(self.rel_file,'not exist, skip')
            return
        relations=json.load(open(rel_file))
        for rel in relations:
            self.create_rel(rel)
        # for file in self.rel_files:
        #     rel_file = os.path.join(self.data_path, file)
        #     if not os.path.exists(rel_file):
        #         print(file, 'not exist, skip')
        #         continue
        #     rels_set = json.load(open(rel_file))
        #     self.create_rel(rels_set)

    def create_rel(self,rels_set):
        cnt=0
        start_entity_type=rels_set['start_entity_type']
        end_entity_type=rels_set['end_entity_type']
        rel_type=rels_set['rel_type']
        rel_name=rels_set['rel_name']
        rels=rels_set['rels']
        for rel in rels:
            p=rel['start_entity_name']
            q=rel['end_entity_name']
            query = "match(p:%s),(q:%s) where p.name='%s'and q.name='%s' create (p)-[rel:%s{name:'%s'}]->(q)" % (
                start_entity_type, end_entity_type, p, q, rel_type, rel_name)
            try:
                self.g.run(query)
                cnt+=1
                print(rel_type,cnt,len(rels))
            except Exception as e:
                print(e)
        return

if __name__ == '__main__':
    handler = MedicalGraphFromJson()
    handler.build_graph()

